<div class="row">
        <div class="col-lg-9">
            <h1>183.Customers Who Never Order</h1>
            <div class="markdown-body" style="margin-top: 20px">
                <p>Suppose that a website contains two tables, the <code>Customers</code> table and the <code>Orders</code> table. Write a SQL query to find all customers who never order anything.</p>

<p>Table: <code>Customers</code>.</p>

<pre>
+----+-------+
| Id | Name  |
+----+-------+
| 1  | Joe   |
| 2  | Henry |
| 3  | Sam   |
| 4  | Max   |
+----+-------+
</pre>

<p>Table: <code>Orders</code>.</p>

<pre>
+----+------------+
| Id | CustomerId |
+----+------------+
| 1  | 3          |
| 2  | 1          |
+----+------------+
</pre>

<p>Using the above tables as example, return the following:</p>

<pre>
+-----------+
| Customers |
+-----------+
| Henry     |
| Max       |
+-----------+
</pre>

In [1]:
import sqlalchemy
import pandas as pd
engine = sqlalchemy.create_engine('mysql+mysqlconnector://root:newpass_1234@localhost:3306/sys')

In [3]:
pd.read_sql_table("Customers", engine)

   Id   Name
0   1    Joe
1   2  Henry
2   3    Sam
3   4    Max

In [5]:
pd.read_sql_table("Orders", engine)

   Id  CustomerId
0   1           3
1   2           1

In [8]:
query = '''
SELECT c.Name
FROM Customers c
WHERE c.Id NOT IN (SELECT o.CustomerId
                   FROM Orders o);
'''
pd.read_sql_query(query, engine)

    Name
0  Henry
1    Max

## Note
# Time: O(nk)
# Space: O(1)